#### Terraform Format and Style 🖌 `failure` (ignored)
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 Success! The configuration is valid.


#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.discord_simde.discord_channel_permission.curieux_spam will be updated in-place
  ~ resource "discord_channel_permission" "curieux_spam" {
      ~ allow        = 100764736 -> 100762688
      ~ deny         = 197889 -> 199937
        id           = "190204804"
        # (3 unchanged attributes hidden)
    }

  # module.discord_simde.discord_channel_permission.member_spam will be updated in-place
  ~ resource "discord_channel_permission" "member_spam" {
      ~ allow        = 100764736 -> 100762688
      ~ deny         = 197889 -> 199937
        id           = "2945653219"
        # (3 unchanged attributes hidden)
    }

  # module.github.github_repository.emploidutApi will be created
  + resource "github_repository" "emploidutApi" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Backend de emploidut"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_downloads          = false
      + has_issues             = true
      + has_projects           = true
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + name                   = "emploidut-api"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "api",
          + "emploidut",
          + "service",
        ]
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.github.github_team.emploidut will be created
  + resource "github_team" "emploidut" {
      + description = "Développer la nouvelle version de Emploidut"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "Emploidut"
      + node_id     = (known after apply)
      + privacy     = "closed"
      + slug        = (known after apply)
    }

  # module.github.github_team_repository.emploidut_emploidutApi will be created
  + resource "github_team_repository" "emploidut_emploidutApi" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "emploidut-api"
      + team_id    = (known after apply)
    }

  # module.github.module.arthur_wacquez.github_membership.membership will be created
  + resource "github_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "0uTl0w24"
    }

  # module.github.module.victor_tondolo.github_membership.membership will be created
  + resource "github_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "0uTl0w24"
    }

Plan: 5 to add, 2 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```

</details>

*Pusher: @cesar-richard, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform CI`*